<?php

namespace App\Http\Requests;

use Illuminate\Foundation\Http\FormRequest;

class RegisterRequest extends FormRequest
{
    public function rules(): array
    {
        return [
            'email' => [
                'required',
                'email',
                'unique:users,email',
            ],

            'password' => [
                'required',
                'string',
                'min:8',
                'confirmed',
            ],

            'mobile' => [
                'required',
                'string',
                'unique:users,mobile',
            ],

            'name' => [
                'required',
                'string',
            ],
        ];
    }

    public function messages(): array
    {
        return [
            /*
            |--------------------------------------------------------------------------
            | Email
            |--------------------------------------------------------------------------
            */

            'email.required' => 'وارد کردن ایمیل الزامی است.',
            'email.email' => 'فرمت ایمیل واردشده معتبر نیست.',
            'email.unique' => 'این ایمیل قبلاً در سامانه ثبت شده است.',


            /*
            |--------------------------------------------------------------------------
            | Password
            |--------------------------------------------------------------------------
            */

            'password.required' => 'وارد کردن رمز عبور الزامی است.',
            'password.string' => 'رمز عبور واردشده معتبر نیست.',
            'password.min' => 'رمز عبور باید حداقل ۸ کاراکتر باشد.',
            'password.confirmed' => 'تکرار رمز عبور با رمز عبور مطابقت ندارد.',


            /*
            |--------------------------------------------------------------------------
            | Mobile
            |--------------------------------------------------------------------------
            */

            'mobile.required' => 'وارد کردن شماره موبایل الزامی است.',
            'mobile.string' => 'شماره موبایل واردشده معتبر نیست.',
            'mobile.unique' => 'این شماره موبایل قبلاً در سامانه ثبت شده است.',


            /*
            |--------------------------------------------------------------------------
            | Name
            |--------------------------------------------------------------------------
            */

            'name.required' => 'وارد کردن نام و نام خانوادگی الزامی است.',
            'name.string' => 'نام و نام خانوادگی واردشده معتبر نیست.',
        ];
    }
}
